Zhang-JK/ACController/STM32/ACControl/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
int _write(int fd, char *ptr, int len);
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_ON_BOARD_Pin GPIO_PIN_13
#define LED_ON_BOARD_GPIO_Port GPIOC
#define LED0_Pin GPIO_PIN_3
#define LED0_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_4
#define LED1_GPIO_Port GPIOA
#define LED2_Pin GPIO_PIN_5
#define LED2_GPIO_Port GPIOA
#define TEMP_PIN_Pin GPIO_PIN_6
#define TEMP_PIN_GPIO_Port GPIOA
#define MAIN_SWITCH_Pin GPIO_PIN_0
#define MAIN_SWITCH_GPIO_Port GPIOB
#define REMOTE_SWITCH_Pin GPIO_PIN_1
#define REMOTE_SWITCH_GPIO_Port GPIOB
#define ON_SWITCH_Pin GPIO_PIN_10
#define ON_SWITCH_GPIO_Port GPIOB
#define OFF_SWITCH_Pin GPIO_PIN_11
#define OFF_SWITCH_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
#define RXBUFFERSIZE 512
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
